Revit 2024 API
IFCProductWrapper.AddFinishMaterial Method
 Adds a material handle to associate with the IfcProduct in this wrapper.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void AddFinishMaterial(
	IFCAnyHandle material
)
Visual Basic
Public Sub AddFinishMaterial ( _
	material As IFCAnyHandle _
)
Visual C++
public:
void AddFinishMaterial(
	IFCAnyHandle^ material
)
Parameters
material
Type: Autodesk.Revit.DB.IFC.IFCAnyHandle
 The material handle.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
IFCProductWrapper Class
Autodesk.Revit.DB.IFC Namespace